app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."created_at" DESC
---
  def index
    items = Item.order(created_at: :desc)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    item = Item.find(params[:id])

INSERT INTO "items" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2026-03-22 15:27:11.118402"], ["description", "Desc"], ["name", "New Item"], ["updated_at", "2026-03-22 15:27:11.118402"]]
---
  def create
    item = Item.new(item_params)
    if item.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 7]]
---
  def destroy
    item = Item.find(params[:id])
    item.destroy